# Задача 3 ко второму занятию
mo = int(input('Введите номер месяца: '))
se = {(12, 1, 2): 'зима', (3, 4, 5): 'весна', (6, 7, 8): 'лето', (9, 10, 11): 'осень'}
i = 0
for i in se:
    if mo in i:
        print('На дворе', se.get(i))
