# Задача 6 ко второму занятию
i = 1
z = '-'
y = '+'
t_l = []
c_l = []
k_l = []
e_l = []
p = []
while z != y:
    t = input('Название товара: ')
    c = input('Цена товара, руб.: ')
    k = input('Количество единиц товара: ')
    e = input('Единица измерения: ')
    print('----------------------------------')
    t_l += [t]
    c_l += [c]
    k_l += [k]
    e_l += [e]
    slv = {"Название:": t_l, "Цена:": c_l, "Количество:": k_l, "ед.:": e_l}
    sl = {"Название:": t, "Цена:": c, "Количество:": k, "ед.:": e}
    p.extend([i, sl])
    pr = tuple(p)
    for ip in range(0, len(pr), 2):
        print(pr[ip], pr[ip + 1])
    print('----------------------------------')
    while y != 'q' or y != 'n':
        y = input('  "S" - Аналитика'
                  '\n  "N" - Добавить товар в базу'
                  '\n  "Q" - Завершить работу '
                  '\nВведите букву и нажмите "enter": ')
        print('----------------------------------')
        if y == 'q':
            break
        if y == 'n':
            i = i + 1
            break
        if y == 's':
            for w in sl:
                print(str(w), slv.get(w))
            print('----------------------------------')
    if y == 'n':
        continue
    else:
        break
